# 1.Треугольник существует только тогда,
#  когда сумма любых двух его сторон больше третьей.
# Дано a, b, c - стороны предполагаемого треугольника.
# Требуется сравнить длину каждого отрезка-стороны с суммой двух других.
# Если хотя бы в одном случае отрезок окажется больше суммы двух других,
# то треугольника с такими сторонами не существует.
# Отдельно сообщить является ли треугольник разносторонним,
#  равнобедренным или равносторонним.

a = 5
b = 2
c = 3

if a > b + c or b > a + c or c > a + b:
    print('Треугольника с такими сторонами не существует')
elif a == b and b == c:
    print('Треугольник равносторонним')
elif a == b or b == c or a == c:
    print('Треугольник равнобедренным')
else:
    print('Треугольник разносторонним')
