# 2. Напишите программу, которая получает целое число и возвращает его
# шестнадцатеричное строковое представление.
# Функцию hex используйте для проверки своего результата.
NUMBER_SYSTEM = 16

numbers = {0: '0', 1: '1', 2: '2', 3: '3', 4: '4',
           5: '5', 6: '6', 7: '7', 8: '8', 9: '9',
           10: 'A', 11: 'B', 12: 'C', 13: 'D',
           14: 'E', 15: 'F'}

num = 1239
res = ''

while num > 0:
    temp = num % NUMBER_SYSTEM
    res = numbers[temp] + res
    num //= NUMBER_SYSTEM
print(res)
print(hex(1239))
